; domain
(define (domain bookseller)

    (:requirements :strips :typing)

    (:types book location drone capacity - object)

    (:predicates 
        (book-at ?b - book ?l - location)
        (drone-at ?d - drone ?l - location)
        (path ?l1 - location ?l2 - location)
        (empty ?d - drone)
        (first ?b - book ?d - drone)
        (last ?b - book ?d - drone)
        (ontop ?b1 - book ?b2 - book)
    )

    (:action loadFirst
        :parameters (?d - drone ?b - book ?l - location)
        :precondition (and (drone-at ?d ?l) (book-at ?b ?l) (empty ?d))
        :effect (and (not (empty ?d)) (first ?b ?d) (last ?b ?d) (not (book-at ?b ?l)))
    )

    (:action loadBottom
        :parameters (?d - drone ?b1 ?b2 - book ?l - location)
        :precondition (and (drone-at ?d ?l) (book-at ?b2 ?l) (last ?b1 ?d))
        :effect (and (not (last ?b1 ?d)) (not (book-at ?b ?l)) (ontop ?b1 ?b2) (last ?b2 ?d))
    )

    (:action unloadFinal
        :parameters (?d - drone ?b - book ?l - location)
        :precondition (and (drone-at ?d ?l) (first ?b ?d) (last ?b ?d))
        :effect (and (empty ?d) (book-at ?b ?l) (not (last ?b ?d)) (not (first ?b ?d)))
    )

    (:action unloadBottom
        :parameters (?d - drone ?b1 ?b2 - book ?l - location)
        :precondition (and (drone-at ?d ?l) (ontop ?b1 ?b2) (last ?b2 ?d))
        :effect (and (book-at ?b1 ?l) (not (ontop ?b1 ?b2)) (not (last ?b2 ?d)) (last ?b1 ?d))
    )

    (:action flyDrone
        :parameters (?d - drone ?l1 ?l2 - location)
        :precondition (and (drone-at ?d ?l1) (path ?l1 ?l2))
        :effect (and (drone-at ?d ?l2) (not (drone-at ?d ?l1)))
    )
)

; problem
(define (problem bookseller-prob-5loc-4bk-2dr)
  (:domain bookseller)

  (:objects
    book1 book2 book3 book4 - book
    loc1 loc2 loc3 loc4 loc5 - location
    drone1 drone2 - drone
  )

  (:init
    (book-at book1 loc3)
    (book-at book2 loc3)
    (book-at book3 loc2)
    (book-at book4 loc5)

    (drone-at drone1 loc1)
    (empty drone1)
    (drone-at drone2 loc2)
    (empty drone2)

    (path loc1 loc2)
    (path loc2 loc1)
    (path loc2 loc3)
    (path loc3 loc2)
    (path loc3 loc4)
    (path loc4 loc3)
    (path loc4 loc2)
    (path loc2 loc4)
    (path loc5 loc1)
    (path loc1 loc5)
  )

  (:goal (and
    (book-at book1 loc5)
    (book-at book2 loc3)
    (book-at book3 loc5)
    (book-at book4 loc1)
  ))
)

; plan
1. (flydrone drone2 loc2 loc3)
   deleted: (drone-at drone2 loc2)
   added: (drone-at drone2 loc3)
   goals met: 1 of 4
2. (loadfirst drone2 book1 loc3)
   deleted: (empty drone2) (book-at book1 loc3)
   added: (first book1 drone2) (last book1 drone2)
   goals met: 1 of 4
3. (flydrone drone2 loc3 loc2)
   deleted: (drone-at drone2 loc3)
   added: (drone-at drone2 loc2)
   goals met: 1 of 4
4. (loadbottom drone2 book1 book3 loc2)
   deleted: (last book1 drone2)
   added: (ontop book1 book3) (last book3 drone2)
   goals met: 1 of 4
5. (loadbottom drone2 book3 book3 loc2)
   added: (ontop book3 book3)
   goals met: 1 of 4
6. (flydrone drone2 loc2 loc1)
   deleted: (drone-at drone2 loc2)
   added: (drone-at drone2 loc1)
   goals met: 1 of 4
7. (flydrone drone2 loc1 loc5)
   deleted: (drone-at drone2 loc1)
   added: (drone-at drone2 loc5)
   goals met: 1 of 4
8. (unloadbottom drone2 book3 book3 loc5)
   deleted: (ontop book3 book3)
   added: (book-at book3 loc5)
   goals met: 2 of 4
9. (flydrone drone1 loc1 loc5)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 loc5)
   goals met: 2 of 4
10. (loadfirst drone1 book4 loc5)
   deleted: (empty drone1) (book-at book4 loc5)
   added: (first book4 drone1) (last book4 drone1)
   goals met: 2 of 4
11. (unloadbottom drone2 book1 book3 loc5)
   deleted: (ontop book1 book3) (last book3 drone2)
   added: (book-at book1 loc5) (last book1 drone2)
   goals met: 3 of 4
12. (flydrone drone1 loc5 loc1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 loc1)
   goals met: 3 of 4
13. (unloadfinal drone1 book4 loc1)
   deleted: (last book4 drone1) (first book4 drone1)
   added: (empty drone1) (book-at book4 loc1)
   goals met: 4 of 4
